djraval/ESP32-C6-LCD-1.47-Template/sdkconfig.defaults
# ESP32-C6-LCD-1.47 Minimal Template Configuration
#
# Essential settings for the Waveshare ESP32-C6-LCD-1.47 development board

# Target Configuration
CONFIG_IDF_TARGET="esp32c6"
CONFIG_LV_COLOR_16_SWAP=y

# Flash Configuration (4MB flash)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# LVGL Optimizations
CONFIG_LV_BUILD_EXAMPLES=n

# Compiler Optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Memory Configuration — custom partition table gives the app 2 MB so WiFi + MQTT fit
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Log Level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Driver optimizations for better performance
CONFIG_SPI_MASTER_ISR_IN_IRAM=y
CONFIG_LEDC_ISR_IRAM_SAFE=y
CONFIG_RMT_ISR_IRAM_SAFE=y

# Disable Bluetooth to save flash. WiFi is enabled (used by net_hal).
CONFIG_BT_ENABLED=n

# LVGL additional optimizations
CONFIG_LV_MEM_CUSTOM=y

# FreeRTOS optimization
CONFIG_FREERTOS_HZ=1000
